[{"joke":"Chuck Norris CAN see John Cena, and he still thinks he's a bitch."},{"joke":"Chuck Norris knows how to get to Seasame Street."},{"joke":"Chuck Norris roundhouse kicked this fact."},{"joke":{}},{"joke":{}},{},{"joke":"For Chuck Norris, post-coitus and post-mortem mean the same damn thing."},{},{},{},{},{"joke":"Chuck Norris once made a waterfall run backwards by sheer intimidation."},{"joke":"Chuck Norris went to the bottom of the bottomless pit, he was so pissed there was a bottom, he roundhouse kicked it and now it truly is bottomless"},{"joke":"Chuck Norris can make you piss your soul."},{"joke":"Chuck Norris once kicked a horse in its chin. Its decendants are now known as giraffes."},{"joke":"Chuck Norris was once minted on the dollar bill, but after thousands died, it became apparent that no-one pays out Chuck Norris and lives."},{"joke":"Camels have a hump because Chuck Norris needed a place to store his kills."},{"joke":"Chuck Norris could find you. with his eyes closed."},{"joke":"If Chuck Norris ate at your restaurant and had only $5 for his $50 meal, you would still owe him change."},{"joke":"A man once asked Chuck Norris, \"what happens when an unstoppable force meets and immovable object?\" Chuck Norris answered the question by punching himself in the face."},{"joke":"Welcome to Chucknorrism. The site of Chuck Norris facts. Make a fact or you'll piss off Chuck Norris."},{"joke":"Chuck Norris doesn't have an age - he has a half-life."},{"joke":"Chuck Norris once played a game of Russian roulette with a fully-loaded gun. He won."},{"joke":"Chuck Norris made Twisted Sister take it some more."},{"joke":"Chuck Norris doesn't fly, gravity collapses around him."},{"joke":"Chuck Norris made the dinasaurs extinct"},{"joke":"Q: How much wood could a woodchuck chuck if a woodchuck could Chuck Norris? A: All of it..."},{"joke":"The sun really shines on Chuck Norris. We just happen to live close enough to him."},{"joke":"For Chuck Norris, NP-Hard = O(1)."},{"joke":"Chuck Norris can have phone sex using morse code."},{"joke":"Whenever Chuck Norris gets a massage, he gives the female masseuse a happy ending."}]